Revit 2015 API
GridTypeSet.ForwardIterator Method
Retrieve a forward moving iterator to the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
public virtual GridTypeSetIterator ForwardIterator()
Visual Basic
Public Overridable Function ForwardIterator As GridTypeSetIterator
Visual C++
public:
virtual GridTypeSetIterator^ ForwardIterator()
Return Value
Returns a forward moving iterator to the set.
See Also
GridTypeSet Class
Autodesk.Revit.DB Namespace